zephyrproject-rtos/zephyr/drivers/mspi/mspi_esp32.c
/*
 * Copyright (c) 2026 Pavel Maloletkov.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT espressif_esp32_mspi

/*
 * esp-idf headers first — avoids BIT() redefinition warning.
 * Pattern taken directly from spi_esp32_spim.c.
 */
#include <hal/spi_hal.h>
#include <hal/spi_ll.h>
#include <esp_attr.h>
#include <esp_clk_tree.h>

#include <zephyr/kernel.h>
#include <zephyr/cache.h>
#include <zephyr/device.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/interrupt_controller/intc_esp32.h>
#include <zephyr/sys/util.h>
#include <zephyr/logging/log.h>
#include <soc.h>
#include <esp_memory_utils.h>

#ifdef SOC_GDMA_SUPPORTED
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_esp32.h>
#endif

#if defined(CONFIG_MSPI_ESP32_PSRAM_DMA) && defined(SOC_GDMA_SUPPORTED) &&                         \
	defined(SOC_PSRAM_DMA_CAPABLE)
#include <esp_cache.h>
#define MSPI_ESP32_PSRAM_DMA 1
#endif

#include <soc/spi_periph.h>

#include "mspi_esp32.h"

LOG_MODULE_REGISTER(mspi_esp32, CONFIG_MSPI_LOG_LEVEL);

#define SPI_DMA_RX 0
#define SPI_DMA_TX 1

/* --------------------------------------------------------------------------
 * Helpers
 * --------------------------------------------------------------------------
 */

static int mspi_mode_to_esp32(enum mspi_cpp_mode mode)
{
	switch (mode) {
	case MSPI_CPP_MODE_0:
		return 0; /* CPOL=0, CPHA=0 */
	case MSPI_CPP_MODE_1:
		return 1; /* CPOL=0, CPHA=1 */
	case MSPI_CPP_MODE_2:
		return 2; /* CPOL=1, CPHA=0 */
	case MSPI_CPP_MODE_3:
		return 3; /* CPOL=1, CPHA=1 */
	default:
		LOG_ERR("Unsupported SPI mode %d", mode);
		return -ENOTSUP;
	}
}

static spi_line_mode_t get_spi_line_mode(enum mspi_io_mode io_mode)
{
	spi_line_mode_t line_mode = {0};

	switch (io_mode) {
	case MSPI_IO_MODE_SINGLE:
		line_mode.cmd_lines = 1;
		line_mode.addr_lines = 1;
		line_mode.data_lines = 1;
		break;
	case MSPI_IO_MODE_DUAL:
	case MSPI_IO_MODE_DUAL_1_1_2:
		line_mode.cmd_lines = 1;
		line_mode.addr_lines = 1;
		line_mode.data_lines = 2;
		break;
	case MSPI_IO_MODE_DUAL_1_2_2:
		line_mode.cmd_lines = 1;
		line_mode.addr_lines = 2;
		line_mode.data_lines = 2;
		break;
	case MSPI_IO_MODE_QUAD:
	case MSPI_IO_MODE_QUAD_1_1_4:
		line_mode.cmd_lines = 1;
		line_mode.addr_lines = 1;
		line_mode.data_lines = 4;
		break;
	case MSPI_IO_MODE_QUAD_1_4_4:
		line_mode.cmd_lines = 1;
		line_mode.addr_lines = 4;
		line_mode.data_lines = 4;
		break;
	case MSPI_IO_MODE_OCTAL:
	case MSPI_IO_MODE_OCTAL_1_1_8:
		line_mode.cmd_lines = 1;
		line_mode.addr_lines = 1;
		line_mode.data_lines = 8;
		break;
	case MSPI_IO_MODE_OCTAL_1_8_8:
		line_mode.cmd_lines = 1;
		line_mode.addr_lines = 8;
		line_mode.data_lines = 8;
		break;
	default:
		return get_spi_line_mode(MSPI_IO_MODE_SINGLE);
	}

	return line_mode;
}

static int cs_gpio_set(const struct mspi_esp32_data *data, const struct mspi_esp32_config *config,
		       bool active)
{
	if (!config->mspi_config.ce_group || config->mspi_config.num_ce_gpios == 0) {
		LOG_DBG("CS: no GPIO CE group, skipping (HW CS in use)");
		return 0;
	}

	const struct gpio_dt_spec *cs = config->mspi_config.ce_group + data->mspi_dev_config.ce_num;

	bool pin_high =
		(data->mspi_dev_config.ce_polarity == MSPI_CE_ACTIVE_HIGH) ? active : !active;

	return gpio_pin_set_dt(cs, pin_high ? 1 : 0);
}

/* --------------------------------------------------------------------------
 * Timing configuration
 * --------------------------------------------------------------------------
 */

static int update_timing_config(const struct mspi_esp32_config *config,
				struct mspi_esp32_data *data, spi_hal_timing_conf_t *timing_conf,
				uint32_t clock_frequency)
{
	if (clock_frequency > config->mspi_config.max_freq) {
		LOG_ERR("Requested freq %u exceeds max %u", clock_frequency,
			config->mspi_config.max_freq);
		return -EINVAL;
	}

	data->clock_frequency = clock_frequency;

	spi_hal_timing_param_t tp = {
		.clk_src_hz = data->clock_source_hz,
		.half_duplex = data->dev_config.half_duplex,
		.no_compensate = data->dev_config.no_compensate,
		.expected_freq = clock_frequency,
		.duty_cycle = config->duty_cycle == 0 ? 128 : config->duty_cycle,
		.input_delay_ns = config->input_delay_ns,
		.use_gpio = !config->use_iomux,
	};

	LOG_DBG("timing: clk_src_hz=%u expected=%u duty=%u input_delay_ns=%u use_gpio=%d",
		tp.clk_src_hz, tp.expected_freq, tp.duty_cycle, tp.input_delay_ns, tp.use_gpio);

	/* New HAL: two-argument form, returns esp_err_t */
	esp_err_t err = spi_hal_cal_clock_conf(&tp, timing_conf);

	if (err != ESP_OK) {
		LOG_ERR("spi_hal_cal_clock_conf failed: %d", err);
		return -EINVAL;
	}

	LOG_DBG("timing: dummy_bits=%d", timing_conf->timing_dummy);

	return 0;
}

/* --------------------------------------------------------------------------
 * DMA helpers — GDMA (ESP32-S3, C3, C6, …)
 * --------------------------------------------------------------------------
 */

#ifdef SOC_GDMA_SUPPORTED

static int mspi_gdma_config(const struct device *dev, uint8_t dir, uint8_t *buf, size_t len)
{
	const struct mspi_esp32_config *cfg = dev->config;
	struct mspi_esp32_data *data = dev->data;
	uint8_t dma_channel = (dir == SPI_DMA_RX) ? cfg->dma_rx_ch : cfg->dma_tx_ch;
	bool *configured =
		(dir == SPI_DMA_RX) ? &data->rx_dma_configured : &data->tx_dma_configured;
	struct dma_status dma_status = {};
	int err = 0;

	if (dma_channel == 0xFF) {
		LOG_ERR("DMA channel is not configured in device tree");
		return -EINVAL;
	}

	err = dma_get_status(cfg->dma_dev, dma_channel, &dma_status);
	if (err) {
		return -EINVAL;
	}

	if (dma_status.busy) {
		LOG_ERR("DMA channel %d is busy", dma_channel);
		return -EBUSY;
	}

	if (*configured) {
		/*
		 * A fixed TX or RX channel's direction/slot/burst length never
		 * change once configured, so just rebind the descriptor chain to
		 * the new buffer/length instead of paying for a full dma_config()
		 * (channel/periph_id lookup + burst-length validation) on every
		 * chunk. Measured overhead made this worth it: per-chunk driver
		 * overhead was a significant fraction of each flush's SPI time.
		 */
		uint32_t addr = (uint32_t)buf;

		err = dma_reload(cfg->dma_dev, dma_channel, (dir == SPI_DMA_RX) ? 0 : addr,
				 (dir == SPI_DMA_RX) ? addr : 0, len);
		if (err) {
			LOG_ERR("Error reloading DMA (%d)", err);
		}

