zephyrproject-rtos/zephyr/drivers/mspi/mspi_esp32.c
		return err;
	}

	struct dma_config dma_cfg = {};
	struct dma_block_config dma_blk = {};

	if (dir == SPI_DMA_RX) {
		dma_cfg.channel_direction = PERIPHERAL_TO_MEMORY;
		dma_blk.dest_address = (uint32_t)buf;
	} else {
		dma_cfg.channel_direction = MEMORY_TO_PERIPHERAL;
		dma_blk.source_address = (uint32_t)buf;
	}
	dma_cfg.dma_slot = cfg->dma_host;
	dma_cfg.block_count = 1;
	dma_cfg.head_block = &dma_blk;
	dma_blk.block_size = len;

	dma_cfg.source_data_size = 4; /* 32-bit words */
	dma_cfg.dest_data_size = 4;
	dma_cfg.source_burst_length = 4;
	dma_cfg.dest_burst_length = 4;

	LOG_DBG("gdma_config: dir=%d ch=%u buf=%p len=%u slot=%d", dir, dma_channel, buf, len,
		cfg->dma_host);
	err = dma_config(cfg->dma_dev, dma_channel, &dma_cfg);
	if (err) {
		LOG_ERR("Error configuring DMA (%d)", err);
	} else {
		*configured = true;
	}

	return err;
}

static int mspi_gdma_start(const struct device *dev, uint8_t dir)
{
	const struct mspi_esp32_config *cfg = dev->config;
	uint8_t ch = (dir == SPI_DMA_RX) ? cfg->dma_rx_ch : cfg->dma_tx_ch;

	LOG_DBG("GDMA start: dir=%s ch=%u", dir == SPI_DMA_RX ? "RX" : "TX", ch);
	int ret = dma_start(cfg->dma_dev, ch);

	if (ret != 0) {
		LOG_ERR("GDMA start failed: ch=%u ret=%d", ch, ret);
	}
	return ret;
}

static void mspi_gdma_stop(const struct device *dev, uint8_t dir)
{
	const struct mspi_esp32_config *cfg = dev->config;
	uint8_t ch = (dir == SPI_DMA_RX) ? cfg->dma_rx_ch : cfg->dma_tx_ch;

	LOG_DBG("GDMA stop: dir=%s ch=%u", dir == SPI_DMA_RX ? "RX" : "TX", ch);
	dma_stop(cfg->dma_dev, ch);
}

#else /* !SOC_GDMA_SUPPORTED — integrated DMA on ESP32 / ESP32-S2 */

/* Setup DMA descriptor for ESP32/ESP32-S2 integrated DMA */
static void mspi_dma_desc_setup(lldesc_t *desc, uint8_t *buf, size_t len, bool is_rx)
{
	memset(desc, 0, sizeof(lldesc_t));
	desc->size = len;
	desc->length = is_rx ? 0 : len;
	desc->buf = buf;
	desc->owner = 1;
	desc->eof = 1;
	desc->sosf = 0;
	desc->offset = 0;
	desc->qe.stqe_next = NULL;
}

static void mspi_dma_rx_start(const struct device *dev, uint8_t *buf, size_t len)
{
	const struct mspi_esp32_config *cfg = dev->config;
	struct mspi_esp32_data *data = dev->data;

	mspi_dma_desc_setup(&data->dma_desc_rx, buf, len, true);
	spi_dma_ll_rx_reset((spi_dma_dev_t *)cfg->spi, 0);
	spi_hal_hw_prepare_rx(cfg->spi);
	spi_dma_ll_rx_start((spi_dma_dev_t *)cfg->spi, 0, &data->dma_desc_rx);
}

static void mspi_dma_tx_start(const struct device *dev, uint8_t *buf, size_t len)
{
	const struct mspi_esp32_config *cfg = dev->config;
	struct mspi_esp32_data *data = dev->data;

	mspi_dma_desc_setup(&data->dma_desc_tx, buf, len, false);
	spi_dma_ll_tx_reset((spi_dma_dev_t *)cfg->spi, 0);
	spi_hal_hw_prepare_tx(cfg->spi);
	spi_dma_ll_tx_start((spi_dma_dev_t *)cfg->spi, 0, &data->dma_desc_tx);
}

#endif /* SOC_GDMA_SUPPORTED */

/* --------------------------------------------------------------------------
 * transfer() sub-functions
 * --------------------------------------------------------------------------
 */

static void transfer_clear_fifo(spi_hal_context_t *hal)
{
	for (size_t i = 0; i < ARRAY_SIZE(hal->hw->data_buf); ++i) {
#ifdef CONFIG_SOC_SERIES_ESP32C6
		hal->hw->data_buf[i].val = 0;
#else
		hal->hw->data_buf[i] = 0;
#endif
	}
}

static void transfer_setup_cmd_addr(const struct mspi_xfer *xfer,
				    const struct mspi_xfer_packet *packet,
				    spi_hal_trans_config_t *tc)
{
	if (xfer->cmd_length > 0) {
		tc->cmd = (uint16_t)packet->cmd;
		tc->cmd_bits = xfer->cmd_length << 3;
	}

	if (xfer->addr_length > 0) {
		tc->addr = packet->address;
		tc->addr_bits = xfer->addr_length << 3;
	}
}

/*
 * Can the DMA engine be pointed straight at this buffer?
 *
 * Internal DRAM always works. GDMA also reaches PSRAM on SoCs advertising
 * SOC_PSRAM_DMA_CAPABLE, but only for a cache-line aligned address and length:
 * the cache maintenance around the transfer rounds outwards, so a partial line
 * at either end would write back or discard data the CPU still owns.
 */
static bool dma_reachable(const void *buf, size_t len)
{
	if (esp_ptr_dma_capable(buf)) {
		return true;
	}

#ifdef MSPI_ESP32_PSRAM_DMA
	if (esp_ptr_dma_ext_capable(buf)) {
		size_t line = esp_cache_get_line_size_by_addr(buf);

		return line != 0 && IS_ALIGNED(buf, line) && IS_ALIGNED(len, line);
	}
#else
	ARG_UNUSED(len);
#endif

	return false;
}

/*
 * Allocate a single bounce buffer for the data phase and wire it into tc.
 *
 * Since a packet is either TX or RX, only one buffer is ever needed.
 * Returns the allocated buffer (caller must k_free it), or NULL on error
 * (ret is set to a negative errno in that case).
 *
 * When dma_enabled and dir == MSPI_RX the same buffer doubles as the TX
 * zero-fill required by the hardware.
 */
static uint8_t *transfer_prepare_data(const struct device *dev,
				      const struct mspi_xfer_packet *packet,
				      spi_hal_trans_config_t *tc, size_t dma_len,
				      size_t *dma_buf_len, int *ret)
{
	const struct mspi_esp32_config *config = dev->config;
	uint8_t *buffer = NULL;
	*dma_buf_len = ROUND_UP(dma_len, config->dma_buf_size_alignment);

	*ret = 0;

	if (packet->num_bytes == 0) {
		LOG_DBG("transfer: no data phase (num_bytes=0)");
		return NULL;
	}

	int bit_len = (int)(dma_len << 3);

	if (packet->dir == MSPI_TX) {
		uint8_t *src = packet->data_buf;
		bool need_bounce = config->dma_enabled && !dma_reachable(src, dma_len);

		if (need_bounce) {
			buffer = k_aligned_alloc(4, *dma_buf_len);
			if (!buffer) {
				*ret = -ENOMEM;
				return NULL;
			}
			memcpy(buffer, src, dma_len);
			src = buffer;
		} else {
			LOG_DBG("TX buf %p ok (non-DMA path)", src);
		}

		tc->send_buffer = src;
		tc->tx_bitlen = bit_len;
		tc->rx_bitlen = bit_len;

	} else { /* MSPI_RX */
		uint8_t *dst = packet->data_buf;
		bool need_bounce = config->dma_enabled || !esp_ptr_dma_capable((uint32_t *)dst) ||
				   ((uintptr_t)dst % 4 != 0) ||
				   (dma_len % config->dma_buf_size_alignment != 0);

		if (need_bounce) {
			*dma_buf_len = ROUND_UP(dma_len, config->dma_buf_size_alignment);
			buffer = k_calloc(*dma_buf_len, sizeof(uint8_t));
			if (!buffer) {
				*ret = -ENOMEM;
				return NULL;
			}
			dst = buffer;
		} else {
			LOG_DBG("RX buf %p ok (non-DMA path)", dst);
		}

		tc->rcv_buffer = dst;
		tc->rx_bitlen = bit_len;

