zephyrproject-rtos/zephyr/drivers/mspi/mspi_esp32.c
		/*
		 * DMA RX-only: hardware also needs a TX buffer (zero-filled).
		 * Reuse the same bounce buffer by pointing send_buffer at it;
		 * the buffer is already zeroed by k_calloc so no extra fill is needed.
		 */
		if (config->dma_enabled && !tc->send_buffer) {
			tc->send_buffer = dst;
			tc->tx_bitlen = bit_len;
		}
	}

	return buffer;
}

#ifdef SOC_GDMA_SUPPORTED

static int transfer_start_gdma(const struct device *dev, spi_hal_context_t *hal,
			       spi_hal_trans_config_t *tc, size_t dma_buf_len)
{
	int res = 0;

	/*
	 * GDMA reads/writes physical RAM directly and bypasses the CPU data
	 * cache. Buffers can live in cached PSRAM, so without explicit cache
	 * maintenance the peripheral may read stale TX data, or the CPU may
	 * read stale RX data after the transfer — an intermittent-corruption
	 * bug that only shows up under cache pressure.
	 */
	if (tc->rcv_buffer) {
		sys_cache_data_flush_and_invd_range(tc->rcv_buffer, dma_buf_len);
		res = mspi_gdma_config(dev, SPI_DMA_RX, tc->rcv_buffer, dma_buf_len);
		if (res) {
			return res;
		}
	}
	if (tc->send_buffer) {
		sys_cache_data_flush_range(tc->send_buffer, dma_buf_len);
		res = mspi_gdma_config(dev, SPI_DMA_TX, tc->send_buffer, dma_buf_len);
		if (res) {
			return res;
		}
	}

	/* Enable RX DMA path first (same order as SPI driver) */
	if (tc->rcv_buffer) {
		spi_ll_dma_rx_fifo_reset(hal->hw);
		spi_ll_infifo_full_clr(hal->hw);
		spi_ll_dma_rx_enable(hal->hw, 1);

		res = mspi_gdma_start(dev, SPI_DMA_RX);
		if (res) {
			return res;
		}
	}
	if (tc->send_buffer) {
		spi_ll_dma_tx_fifo_reset(hal->hw);
		spi_ll_outfifo_empty_clr(hal->hw);
		spi_ll_dma_tx_enable(hal->hw, 1);

		res = mspi_gdma_start(dev, SPI_DMA_TX);
		if (res) {
			return res;
		}
	}

	/*
	 * Enable data lines AFTER DMA is running — required ordering
	 * documented in the SPI driver comment.
	 */
	spi_hal_enable_data_line(hal->hw, tc->send_buffer != NULL, tc->rcv_buffer != NULL);

	return 0;
}

#else /* !SOC_GDMA_SUPPORTED */

static int transfer_start_intdma(const struct device *dev, spi_hal_context_t *hal,
				 const spi_hal_dev_config_t *hal_dev, spi_hal_trans_config_t *tc,
				 size_t dma_buf_len)
{
	LOG_DBG("transfer: integrated DMA path");

	if (tc->rcv_buffer) {
		LOG_DBG("transfer: intDMA RX start buf=%p len=%zu", tc->rcv_buffer, dma_buf_len);
		mspi_dma_rx_start(dev, tc->rcv_buffer, dma_buf_len);
	}
#ifdef CONFIG_SOC_SERIES_ESP32
	else if (!hal_dev->half_duplex) {
		/*
		 * ESP32 errata: RX DMA channel must be running for
		 * TX-only full-duplex transfers.
		 */
		LOG_DBG("transfer: ESP32 errata — dummy RX DMA start");
		spi_ll_dma_rx_enable(hal->hw, 1);
		spi_dma_ll_rx_start((spi_dma_dev_t *)hal->hw, 0, NULL);
	}
#endif
	if (tc->send_buffer) {
		LOG_DBG("transfer: intDMA TX start buf=%p len=%zu", tc->send_buffer, dma_buf_len);
		mspi_dma_tx_start(dev, (uint8_t *)tc->send_buffer, dma_buf_len);
	}

	LOG_DBG("transfer: intDMA enable_data_line tx=%d rx=%d", tc->send_buffer != NULL,
		tc->rcv_buffer != NULL);
	spi_hal_enable_data_line(hal->hw, tc->send_buffer != NULL, tc->rcv_buffer != NULL);

	return 0;
}

#endif /* SOC_GDMA_SUPPORTED */

#ifdef CONFIG_MSPI_ESP32_INTERRUPT

static void IRAM_ATTR mspi_esp32_isr(void *arg)
{
	const struct device *dev = (const struct device *)arg;
	const struct mspi_esp32_config *config = dev->config;
	struct mspi_esp32_data *data = dev->data;

	spi_ll_disable_int(config->spi);
	spi_ll_clear_int_stat(config->spi);

	k_sem_give(&data->xfer_sem);
}

#endif /* CONFIG_MSPI_ESP32_INTERRUPT */

/*
 * Start the HW transaction configured by spi_hal_setup_trans() and block
 * until it completes or timeout_ms elapses.
 *
 * With CONFIG_MSPI_ESP32_INTERRUPT, the caller blocks on a semaphore signalled
 * by the SPI "transaction done" interrupt, freeing this thread's CPU core for
 * other work while the transfer is in flight. Without it, fall back to a
 * time-bounded poll so a stuck peripheral can never hang the caller (and thus
 * the rest of the system) forever.
 */
static int IRAM_ATTR transfer_start_and_wait(const struct device *dev, uint32_t timeout_ms)
{
	struct mspi_esp32_data *data = dev->data;
	spi_hal_context_t *hal = &data->hal;

#ifdef CONFIG_MSPI_ESP32_INTERRUPT
	const struct mspi_esp32_config *config = dev->config;

	k_sem_reset(&data->xfer_sem);
	spi_ll_clear_int_stat(config->spi);
	spi_ll_enable_int(config->spi);

	spi_hal_user_start(hal);

	if (k_sem_take(&data->xfer_sem, K_MSEC(timeout_ms)) != 0) {
		spi_ll_disable_int(config->spi);
		spi_ll_clear_int_stat(config->spi);
		LOG_ERR("Transfer timed out after %u ms", timeout_ms);
		return -ETIMEDOUT;
	}
#else
	int64_t deadline = k_uptime_get() + timeout_ms;

	spi_hal_user_start(hal);

	while (!spi_hal_usr_is_done(hal)) {
		if (k_uptime_get() > deadline) {
			LOG_ERR("Transfer timed out after %u ms", timeout_ms);
			return -ETIMEDOUT;
		}
	}
#endif

	return 0;
}

static void transfer_post_gdma(const struct device *dev, spi_hal_trans_config_t *tc,
			       size_t dma_buf_len)
{
#ifdef SOC_GDMA_SUPPORTED
	if (tc->rcv_buffer) {
		mspi_gdma_stop(dev, SPI_DMA_RX);
		LOG_DBG("transfer: cache invalidate RX buf=%p len=%zu", tc->rcv_buffer,
			dma_buf_len);
		/* Force the CPU to re-read the data the DMA just wrote. */
		sys_cache_data_invd_range(tc->rcv_buffer, dma_buf_len);
	}
	if (tc->send_buffer) {
		mspi_gdma_stop(dev, SPI_DMA_TX);
	}
#endif
}

/* --------------------------------------------------------------------------
 * Core per-packet transfer
 * --------------------------------------------------------------------------
 */

static int IRAM_ATTR transfer(const struct device *dev, const struct mspi_xfer *xfer,
			      size_t packet_index)
{
	struct mspi_esp32_data *data = dev->data;
	const struct mspi_esp32_config *config = dev->config;
	spi_hal_context_t *hal = &data->hal;
	const spi_hal_dev_config_t *hal_dev = &data->dev_config;

	const struct mspi_xfer_packet *packet = &xfer->packets[packet_index];

	if (packet->num_bytes > CONFIG_MSPI_DMA_MAX_BUFFER_SIZE) {
		LOG_ERR("Packet %zu: %u bytes exceeds MSPI_DMA_MAX_BUFFER_SIZE (%u); "
			"caller must chunk large transfers",
			packet_index, packet->num_bytes,
			(unsigned int)CONFIG_MSPI_DMA_MAX_BUFFER_SIZE);
		return -EMSGSIZE;
	}

	const uint32_t timeout_ms = xfer->timeout ? xfer->timeout : config->transfer_timeout;

	spi_hal_trans_config_t tc = {0};
	/*
	 * These dummy cycles exist purely to give the master extra settling
	 * time before it samples MISO on a read — ESP-IDF's own
	 * spi_hal_setup_trans() only ever applies its equivalent compensation
	 * when trans->rcv_buffer is set. Applying them unconditionally (as the
	 * upstream spi_esp32_spim.c reference driver also does) wastes bus
	 * time on every TX-only transaction.
	 */
	tc.dummy_bits = (packet->dir == MSPI_RX) ? data->trans_config.dummy_bits : 0;
	tc.line_mode = data->trans_config.line_mode;
	tc.cs_keep_active = xfer->hold_ce || (packet_index < (xfer->num_packet - 1));

