zephyrproject-rtos/zephyr/drivers/mspi/mspi_esp32.c
	uint8_t *tmp = NULL;
	int res = 0;

	transfer_clear_fifo(hal);
	transfer_setup_cmd_addr(xfer, packet, &tc);

	size_t dma_len = MIN(packet->num_bytes, CONFIG_MSPI_DMA_MAX_BUFFER_SIZE);
	size_t dma_buf_len = 0;

	tmp = transfer_prepare_data(dev, packet, &tc, dma_len, &dma_buf_len, &res);
	if (res != 0) {
		goto cleanup;
	}

	if (config->dma_enabled) {
#ifdef SOC_GDMA_SUPPORTED
		res = transfer_start_gdma(dev, hal, &tc, dma_buf_len);
#else
		res = transfer_start_intdma(dev, hal, hal_dev, &tc, dma_buf_len);
#endif
		if (res != 0) {
			goto cleanup;
		}
	}

	spi_hal_setup_trans(hal, hal_dev, &tc);

	res = transfer_start_and_wait(dev, timeout_ms);
	if (res != 0) {
		goto cleanup;
	}

	if (config->dma_enabled) {
		transfer_post_gdma(dev, &tc, dma_buf_len);
	} else {
		spi_hal_fetch_result(hal);
	}

	/* Copy bounce buffer back to caller's RX buffer */
	if (tmp && packet->dir == MSPI_RX && packet->data_buf) {
		memcpy(packet->data_buf, tmp, MIN(packet->num_bytes, dma_len));
	}

	LOG_DBG("%s[%zu]: success", __func__, packet_index);

cleanup:
	k_free(tmp);
	return res;
}

/* --------------------------------------------------------------------------
 * Device-level configuration — applied once per transceive() call
 * --------------------------------------------------------------------------
 */

static int IRAM_ATTR update_transfer_config(const struct device *dev)
{
	const struct mspi_esp32_config *config = dev->config;
	struct mspi_esp32_data *data = dev->data;
	spi_hal_context_t *hal = &data->hal;
	spi_hal_dev_config_t *hal_dev = &data->dev_config;

	/*
	 * Snapshot the device-level fields that every packet will inherit.
	 * Packet-level fields (cmd, addr, send_buffer, …) are set in transfer().
	 */
	data->trans_config.dummy_bits = hal_dev->timing_conf.timing_dummy;
	data->trans_config.line_mode = get_spi_line_mode(data->mspi_dev_config.io_mode);

	hal_dev->tx_lsbfirst = false;
	hal_dev->rx_lsbfirst = false;

	LOG_DBG("%s: mode=%d cs_pin_id=%d positive_cs=%d "
		"half_duplex=%d dummy_bits=%u io_mode=%d "
		"lines(cmd=%u addr=%u data=%u)",
		__func__, hal_dev->mode, hal_dev->cs_pin_id, hal_dev->positive_cs,
		hal_dev->half_duplex, data->trans_config.dummy_bits, data->mspi_dev_config.io_mode,
		data->trans_config.line_mode.cmd_lines, data->trans_config.line_mode.addr_lines,
		data->trans_config.line_mode.data_lines);

	/*
	 * The rest of this function reprograms device-level SPI registers and,
	 * on some SoCs, runs an extra dummy transaction below. Neither depends
	 * on io_mode, so skip both unless mspi_esp32_dev_config() actually
	 * changed CPP/CE/frequency. Without this, every single transceive()
	 * call — i.e. every command byte and every data chunk — pays for
	 * a full device reconfiguration plus an extra SPI transaction.
	 */
	if (!data->dev_hw_dirty) {
		return 0;
	}

	/* Program device-level SPI registers */
	spi_hal_setup_device(hal, hal_dev);

	/* ------------------------------------------------------------------
	 * Idle-polarity workaround — not available on original ESP32
	 * ------------------------------------------------------------------
	 */
#ifndef CONFIG_SOC_SERIES_ESP32
	{
		spi_dev_t *hw = hal->hw;
		int pol = config->line_idle_low ? 0 : 1;

		hw->ctrl.d_pol = pol;
		hw->ctrl.q_pol = pol;
		hw->ctrl.hold_pol = pol;
		hw->ctrl.wp_pol = pol;
	}
#endif

	/* ------------------------------------------------------------------
	 * CLK/CS phase-alignment dummy transaction.
	 *
	 * On ESP32-S3 and ESP32-Cx, software-driven CS can leave CLK out of
	 * phase after a mode-3 reconfiguration.  Send one zero byte to
	 * re-align before the real transaction.
	 *
	 * Not needed on ESP32 or ESP32-S2 (hardware manages it).
	 * ------------------------------------------------------------------
	 */
#if !defined(CONFIG_SOC_SERIES_ESP32) && !defined(CONFIG_SOC_SERIES_ESP32S2)
	if (config->mspi_config.num_ce_gpios > 0 && hal_dev->mode == 3) {
		uint8_t dummy_byte = 0x00;
		struct mspi_xfer_packet dummy_pkt = {
			.dir = MSPI_TX,
			.data_buf = &dummy_byte,
			.num_bytes = sizeof(dummy_byte),
			.cmd = 0,
			.address = 0,
		};
		struct mspi_xfer dummy_xfer = {
			.packets = &dummy_pkt,
			.num_packet = 1,
			.async = false,
			.timeout = 100,
			.hold_ce = false,
			.cmd_length = 0,
			.addr_length = 0,
		};

		transfer(dev, &dummy_xfer, 0);
	}
#endif

	data->dev_hw_dirty = false;

	return 0;
}

/* --------------------------------------------------------------------------
 * MSPI API — dev_config
 * --------------------------------------------------------------------------
 */

static int mspi_esp32_dev_config(const struct device *dev,
				 [[maybe_unused]] const struct mspi_dev_id *dev_id,
				 const enum mspi_dev_cfg_mask cfg_mask,
				 const struct mspi_dev_cfg *mspi_dev_config)
{
	struct mspi_esp32_data *data = dev->data;
	const struct mspi_esp32_config *config = dev->config;

	const enum mspi_dev_cfg_mask supported =
		MSPI_DEVICE_CONFIG_IO_MODE | MSPI_DEVICE_CONFIG_CPP | MSPI_DEVICE_CONFIG_CE_NUM |
		MSPI_DEVICE_CONFIG_CE_POL | MSPI_DEVICE_CONFIG_FREQUENCY;

	if (cfg_mask & ~supported) {
		LOG_ERR("Unsupported config mask bits 0x%x", cfg_mask & ~supported);
		return -ENOTSUP;
	}

	/*
	 * Only these fields feed spi_hal_setup_device() / the mode-3 dummy
	 * workaround in update_transfer_config(). io_mode alone must not force
	 * a device-register reprogram on every single transfer.
	 */
	if (cfg_mask & (MSPI_DEVICE_CONFIG_CPP | MSPI_DEVICE_CONFIG_CE_NUM |
			MSPI_DEVICE_CONFIG_CE_POL | MSPI_DEVICE_CONFIG_FREQUENCY)) {
		data->dev_hw_dirty = true;
	}

	if (cfg_mask & MSPI_DEVICE_CONFIG_IO_MODE) {
		data->mspi_dev_config.io_mode = mspi_dev_config->io_mode;
	}

	if (cfg_mask & MSPI_DEVICE_CONFIG_CPP) {
		int mode = mspi_mode_to_esp32(mspi_dev_config->cpp);

		if (mode < 0) {
			return mode;
		}
		data->mspi_dev_config.cpp = mspi_dev_config->cpp;
		data->dev_config.mode = mode;
	}

	if (cfg_mask & MSPI_DEVICE_CONFIG_CE_NUM) {
		data->mspi_dev_config.ce_num = mspi_dev_config->ce_num;
		/*
		 * Hardware CS pin id: use GPIO-driven CS when ce_group is
		 * populated (set cs_pin_id to -1 to disable HW CS), otherwise
		 * map directly to the HW CS line.
		 */
		data->dev_config.cs_pin_id =
			(config->mspi_config.num_ce_gpios > 0) ? -1 : (int)mspi_dev_config->ce_num;
		/* Switching target: any previously-held CE line no longer applies. */
		data->cs_active = false;
	}

	if (cfg_mask & MSPI_DEVICE_CONFIG_CE_POL) {
		data->mspi_dev_config.ce_polarity = mspi_dev_config->ce_polarity;
		data->dev_config.positive_cs =
			(mspi_dev_config->ce_polarity == MSPI_CE_ACTIVE_HIGH);
		data->cs_active = false;
	}

	if (cfg_mask & MSPI_DEVICE_CONFIG_FREQUENCY) {
		int ret = update_timing_config(config, data, &data->dev_config.timing_conf,
					       mspi_dev_config->freq);
		if (ret != 0) {
			LOG_ERR("Failed to recalculate timing: %d", ret);
			return ret;
		}
	}

