zephyrproject-rtos/zephyr/drivers/mspi/mspi_esp32.c
	return 0;
}

/* --------------------------------------------------------------------------
 * MSPI API — transceive
 * --------------------------------------------------------------------------
 */

static int IRAM_ATTR mspi_esp32_transceive(const struct device *dev,
					   [[maybe_unused]] const struct mspi_dev_id *dev_id,
					   const struct mspi_xfer *xfer)
{
	struct mspi_esp32_data *data = dev->data;
	const struct mspi_esp32_config *config = dev->config;
	int ret = 0;

	if (!xfer || xfer->num_packet == 0 || !xfer->packets) {
		LOG_ERR("Invalid transfer parameters");
		return -EINVAL;
	}

	if (xfer->async) {
		LOG_ERR("Async mode not supported");
		return -ENOTSUP;
	}

	k_mutex_lock(&data->lock, K_FOREVER);

	ret = update_transfer_config(dev);
	if (ret != 0) {
		LOG_ERR("Failed to configure SPI device: %d", ret);
		goto unlock;
	}

	if (!data->cs_active) {
		ret = cs_gpio_set(data, config, true);
		if (ret != 0) {
			LOG_ERR("Failed to assert CS: %d", ret);
			goto unlock;
		}
		data->cs_active = true;
	}

	for (size_t i = 0; i < xfer->num_packet; i++) {
		ret = transfer(dev, xfer, i);
		if (ret != 0) {
			LOG_ERR("Packet %zu failed: %d", i, ret);
			break;
		}
	}

	if (!xfer->hold_ce || ret != 0) {
		int cs_ret = cs_gpio_set(data, config, false);

		data->cs_active = false;

		if (cs_ret != 0) {
			LOG_ERR("Failed to de-assert CS: %d", cs_ret);
			if (ret == 0) {
				ret = cs_ret;
			}
		}
	}

unlock:
	k_mutex_unlock(&data->lock);
	return ret;
}

/* --------------------------------------------------------------------------
 * DMA initialisation
 * --------------------------------------------------------------------------
 */

static int init_dma(const struct device *dev)
{
	const struct mspi_esp32_config *config = dev->config;
	struct mspi_esp32_data *data = dev->data;

#ifdef SOC_GDMA_SUPPORTED
	/*
	 * GDMA: DMA is driven entirely by the Zephyr DMA driver.
	 * Do NOT set hal.dma_enabled — that selects the legacy integrated-DMA
	 * path inside the ESP-IDF HAL and must remain false for GDMA targets.
	 */

	LOG_DBG("%s: GDMA path", __func__);

	if (!device_is_ready(config->dma_dev)) {
		LOG_ERR("DMA device not ready");
		return -ENODEV;
	}

	LOG_DBG("%s: GDMA dma_dev ready, tx_ch=%u rx_ch=%u slot=%d", __func__, config->dma_tx_ch,
		config->dma_rx_ch, config->dma_host);

	data->hal.dma_enabled = false;
	/* Force the next transfer on each channel to run a full dma_config(). */
	data->tx_dma_configured = false;
	data->rx_dma_configured = false;

#else /* !SOC_GDMA_SUPPORTED — integrated DMA (ESP32, ESP32-S2) */

	LOG_DBG("%s: integrated DMA path, enabling DMA clock", __func__);
	if (clock_control_on(config->clock_dev, (clock_control_subsys_t)config->dma_clk_src)) {
		LOG_ERR("Could not enable DMA clock");
		return -EIO;
	}
	data->hal.dma_enabled = true;
	LOG_DBG("%s: DMA clock enabled, dma_host=%d", __func__, config->dma_host);

#ifdef CONFIG_SOC_SERIES_ESP32
	/* Wire the SPI peripheral to its DMA channel */
	DPORT_SET_PERI_REG_BITS(DPORT_SPI_DMA_CHAN_SEL_REG, 3, config->dma_host + 1,
				(config->dma_host + 1) * 2);
	LOG_DBG("%s: ESP32 DMA channel wired", __func__);
#endif

#endif /* SOC_GDMA_SUPPORTED */

	LOG_DBG("%s: done", __func__);
	return 0;
}

/* --------------------------------------------------------------------------
 * CS GPIO setup
 * --------------------------------------------------------------------------
 */

static int cs_configure(const struct device *dev)
{
	const struct mspi_esp32_data *data = dev->data;
	const struct mspi_esp32_config *config = dev->config;
	const struct mspi_cfg *mspi_config = &config->mspi_config;

	for (int i = 0; i < mspi_config->num_ce_gpios; ++i) {
		const struct gpio_dt_spec *cs = mspi_config->ce_group + i;

		if (!device_is_ready(cs->port)) {
			LOG_ERR("CS GPIO %s pin %d not ready", cs->port->name, cs->pin);
			return -ENODEV;
		}

		bool pin_high = (data->mspi_dev_config.ce_polarity == MSPI_CE_ACTIVE_LOW);
		int ret = gpio_pin_configure_dt(cs, pin_high ? GPIO_OUTPUT_ACTIVE
							     : GPIO_OUTPUT_INACTIVE);

		if (ret < 0) {
			return ret;
		}
	}

	return 0;
}

/* --------------------------------------------------------------------------
 * Controller-level configuration  (mspi_config API entry point)
 * --------------------------------------------------------------------------
 */

static int mspi_esp32_config(const struct mspi_dt_spec *spec)
{
	const struct device *dev = spec->bus;
	struct mspi_esp32_data *data = dev->data;
	const struct mspi_esp32_config *config = dev->config;
	int ret;

	/* Force the next transceive() to reprogram device-level registers. */
	data->dev_hw_dirty = true;

	ret = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret) {
		LOG_ERR("Failed to configure pins: %d", ret);
		return ret;
	}

	if (!config->clock_dev || !device_is_ready(config->clock_dev)) {
		LOG_ERR("Clock device not ready");
		return -ENODEV;
	}
	ret = clock_control_on(config->clock_dev, config->clock_subsys);
	if (ret < 0) {
		LOG_ERR("Failed to enable SPI clock: %d", ret);
		return ret;
	}

	spi_hal_init(&data->hal, config->peripheral_id + 1);
	spi_ll_enable_clock(config->peripheral_id + 1, true);

	ret = esp_clk_tree_src_get_freq_hz(config->clock_source,
					   ESP_CLK_TREE_SRC_FREQ_PRECISION_APPROX,
					   &data->clock_source_hz);
	if (ret != ESP_OK) {
		LOG_ERR("Failed to get clock source frequency: %d", ret);
		return -EINVAL;
	}
	LOG_DBG("mspi_config: clock_source_hz=%u", data->clock_source_hz);

	data->mspi_dev_config.freq = config->mspi_config.max_freq;
	ret = update_timing_config(config, data, &data->dev_config.timing_conf,
				   data->mspi_dev_config.freq);
	if (ret != 0) {
		LOG_ERR("Failed to compute timing config: %d", ret);
		return ret;
	}

	if (config->dma_enabled) {
		ret = init_dma(dev);
		if (ret != 0) {
			LOG_ERR("DMA init failed: %d", ret);
			return ret;
		}
	}

	ret = cs_configure(dev);
	if (ret < 0) {
		LOG_ERR("Failed to configure CS GPIOs: %d", ret);
		return ret;
	}

	LOG_INF("ESP32 MSPI (peripheral %u) configured at %u Hz", config->peripheral_id,
		config->mspi_config.max_freq);

