zephyrproject-rtos/zephyr/drivers/mspi/mspi_esp32.c
	return 0;
}

/* --------------------------------------------------------------------------
 * Driver init
 * --------------------------------------------------------------------------
 */

static int mspi_esp32_init(const struct device *dev)
{
	struct mspi_esp32_data *data = dev->data;
	const struct mspi_esp32_config *config = dev->config;

	k_mutex_init(&data->lock);
	k_sem_init(&data->xfer_sem, 0, 1);

	memset(&data->dev_config, 0, sizeof(data->dev_config));
	memset(&data->trans_config, 0, sizeof(data->trans_config));

	data->dev_config.cs_setup = 0;
	data->dev_config.cs_hold = 0;
	data->dev_config.half_duplex = (config->mspi_config.duplex == MSPI_HALF_DUPLEX);
	data->dev_config.tx_lsbfirst = false;
	data->dev_config.rx_lsbfirst = false;
	data->dev_config.no_compensate = false;

	/* Force the first transceive() to program the device-level registers. */
	data->dev_hw_dirty = true;

	/*
	 * Default CS pin: GPIO-driven CS disables hardware CS (cs_pin_id = -1).
	 * Hardware CS maps directly: 0 → CS0, 1 → CS1, 2 → CS2.
	 */
	data->dev_config.cs_pin_id = (config->mspi_config.num_ce_gpios > 0) ? -1 : 0;

	data->clock_frequency = config->mspi_config.max_freq;

	const struct mspi_dt_spec spec = {
		.bus = dev,
		.config = config->mspi_config,
	};

	int ret = mspi_esp32_config(&spec);

	if (ret != 0) {
		LOG_ERR("MSPI config failed: %d", ret);
		return ret;
	}

#ifdef CONFIG_MSPI_ESP32_INTERRUPT
	spi_ll_disable_int(config->spi);
	spi_ll_clear_int_stat(config->spi);

	ret = esp_intr_alloc(config->irq_source,
			     ESP_PRIO_TO_FLAGS(config->irq_priority) |
				     ESP_INT_FLAGS_CHECK(config->irq_flags) | ESP_INTR_FLAG_IRAM,
			     (intr_handler_t)mspi_esp32_isr, (void *)dev, NULL);
	if (ret != 0) {
		LOG_ERR("Could not allocate MSPI interrupt: %d", ret);
		return ret;
	}
#endif

	LOG_INF("ESP32 MSPI driver initialised (peripheral %u)", config->peripheral_id);

	return 0;
}

/* --------------------------------------------------------------------------
 * API table & instance macros
 * --------------------------------------------------------------------------
 */

static DEVICE_API(mspi, mspi_esp32_api) = {
	.config = mspi_esp32_config,
	.dev_config = mspi_esp32_dev_config,
	.transceive = mspi_esp32_transceive,
};

#ifdef SOC_GDMA_SUPPORTED
#define MSPI_DMA_BUF_SIZE_ALIGNMENT(inst)                                                          \
	COND_CODE_1(DT_INST_NODE_HAS_PROP(inst, dmas),                                             \
		    (DT_PROP_OR(DT_INST_DMAS_CTLR_BY_NAME(inst, tx), dma_buf_size_alignment, 4)),  \
		    (4))
#define MSPI_DMA_CFG(inst)                                                                         \
	.dma_dev = ESP32_DT_INST_DMA_CTLR(inst, tx),                                               \
	.dma_tx_ch = ESP32_DT_INST_DMA_CELL(inst, tx, channel),                                    \
	.dma_rx_ch = ESP32_DT_INST_DMA_CELL(inst, rx, channel),                                    \
	.dma_buf_size_alignment = MSPI_DMA_BUF_SIZE_ALIGNMENT(inst),
#else
#define MSPI_DMA_CFG(inst)                                                                         \
	.dma_clk_src = DT_INST_PROP(inst, dma_clk),                                                \
	.dma_buf_size_alignment = 4,
#endif

#define MSPI_CONTROLLER_CONFIG(inst)                                                               \
	{                                                                                          \
		.channel_num = DT_INST_PROP(inst, peripheral_id),                                  \
		.op_mode = MSPI_OP_MODE_CONTROLLER,                                                \
		.duplex = DT_ENUM_IDX_OR(DT_DRV_INST(inst), duplex, MSPI_HALF_DUPLEX),             \
		.max_freq = DT_INST_PROP(inst, clock_frequency),                                   \
		.dqs_support = false,                                                              \
		.num_periph = DT_INST_CHILD_NUM(inst),                                             \
		.sw_multi_periph = DT_INST_PROP_OR(inst, software_multiperipheral, false),         \
		.re_init = false,                                                                  \
		.ce_group = (struct gpio_dt_spec *)ce_gpios##inst,                                 \
		.num_ce_gpios = ARRAY_SIZE(ce_gpios##inst),                                        \
	}

#define ESP32_MSPI_INIT(inst)                                                                      \
	PINCTRL_DT_INST_DEFINE(inst);                                                              \
                                                                                                   \
	static struct gpio_dt_spec ce_gpios##inst[] = MSPI_CE_GPIOS_DT_SPEC_INST_GET(inst);        \
                                                                                                   \
	static struct mspi_esp32_data mspi_esp32_data_##inst = {                                   \
		.hal =                                                                             \
			{                                                                          \
				.hw = (spi_dev_t *)DT_INST_REG_ADDR(inst),                         \
			},                                                                         \
	};                                                                                         \
                                                                                                   \
	static const struct mspi_esp32_config mspi_esp32_cfg_##inst = {                            \
		.spi = (spi_dev_t *)DT_INST_REG_ADDR(inst),                                        \
		.peripheral_id = DT_INST_PROP(inst, peripheral_id),                                \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(inst),                                      \
		.mspi_config = MSPI_CONTROLLER_CONFIG(inst),                                       \
		.clock_dev = DEVICE_DT_GET(DT_NODELABEL(clock)),                                   \
		.clock_subsys = (clock_control_subsys_t)DT_INST_CLOCKS_CELL(inst, offset),         \
		.clock_source = DT_ENUM_IDX_OR(DT_DRV_INST(inst), clk_src, SPI_CLK_SRC_DEFAULT),   \
		.dma_enabled = DT_INST_PROP_OR(inst, dma_enabled, false),                          \
		.dma_host = DT_INST_PROP(inst, dma_host),                                          \
		MSPI_DMA_CFG(inst).line_idle_low = DT_INST_PROP_OR(inst, line_idle_low, false),    \
		.use_iomux = DT_INST_PROP_OR(inst, use_iomux, false),                              \
		.duty_cycle = DT_INST_PROP(inst, duty_cycle),                                      \
		.transfer_timeout = DT_INST_PROP(inst, transfer_timeout),                          \
		.input_delay_ns = 0,                                                               \
		.irq_source = DT_INST_IRQ_BY_IDX(inst, 0, irq),                                    \
		.irq_priority = DT_INST_IRQ_BY_IDX(inst, 0, priority),                             \
		.irq_flags = DT_INST_IRQ_BY_IDX(inst, 0, flags),                                   \
	};                                                                                         \
                                                                                                   \
	DEVICE_DT_INST_DEFINE(inst, mspi_esp32_init, NULL, &mspi_esp32_data_##inst,                \
			      &mspi_esp32_cfg_##inst, POST_KERNEL, CONFIG_MSPI_INIT_PRIORITY,      \
			      &mspi_esp32_api);

DT_INST_FOREACH_STATUS_OKAY(ESP32_MSPI_INIT)
